app/Controllers/admin/AdminEmpleadosController.php

SELECT *
FROM `empleado`
---
    public function index()
    {
        $empleado = new AdminEmpleadosModel();
        $datos['empleados'] = $empleado->findAll();

INSERT INTO `empleado` (`dpi_empleado`, `contrasenia`, `email`, `nombre`, `apellido`, `rol_id`) VALUES ('6', '123456', 'prueba@gmail.com', 'Prueba', '1', '1')
---
    public function agregar()
    {
        $empleado = new AdminEmpleadosModel();
        $datos = [
            'dpi_empleado' => $this->request->getPost('dpi_empleado'),
            'contrasenia' => $this->request->getPost('pwd_empleado'),
            'email' => $this->request->getPost('txt_email'),
            'nombre' => $this->request->getPost('txt_nombre'),
            'apellido' => $this->request->getPost('txt_apellido'),
            'rol_id' => $this->request->getPost('rol_id'),
        ];
        $empleado->insert($datos);