app/Controllers/admin/AdminClientesController.php

    public function index()
    {
        $cliente = new AdminClientesModel();
        $datos['clientes'] = $cliente->findAll();
---
SELECT *
FROM `clientes`

    public function agregar()
    {
        $cliente = new AdminClientesModel();
        $datos = [
            'cliente_id' => $this->request->getPost('id_cliente'),
            'email' => $this->request->getPost('txt_email'),
            'contrasenia' => $this->request->getPost('pwd_cliente'),
            'nombre' => $this->request->getPost('txt_nombre'),
            'apellido' => $this->request->getPost('txt_apellido'),
            'fecha_nac' => $this->request->getPost('dt_nacimiento'),
        ];
        $cliente->insert($datos);
---
INSERT INTO `clientes` (`cliente_id`, `email`, `contrasenia`, `nombre`, `apellido`, `fecha_nac`) VALUES ('7', 'prueba@gmail.com', '123456', 'Prueba', '1', '2000-05-10')

    public function buscar($id)
    {
        $cliente = new AdminClientesModel();
        $datos['datos']=$cliente->where(['cliente_id'=>$id])->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '7'
 LIMIT 1