app/Controllers/admin/ProductoController.php

SELECT *
FROM `productos`
---
    public function index(): string
    {
        $producto = new ProductosModel();

        $datos['datos'] = $producto->findAll();