app/Controllers/AdminClientesController.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $cliente = new AdminClientesModel();
        $datos['clientes'] = $cliente->findAll();