app/Controllers/AdminEmpleadosController.php

    public function index()
    {
        $empleado = new AdminEmpleadosModel();
        $datos['empleados'] = $empleado->findAll();
---
SELECT *
FROM `empleado`