app/Controllers/CarritoController.php

    public function agregar()
    {
        $producto_id = $this->request->getPost('producto_id');
        $cantidad = $this->request->getPost('cantidad');

        $productoModel = new ProductoModel();
        $producto = $productoModel->find($producto_id);
---
SELECT *
FROM `productos`
WHERE `productos`.`producto_id` = '108'