app/Controllers/ClientesController.php

    public function index()
    {
        $cliente = new ClientesModel();
        $datos['clientes'] = $cliente->findAll();
---
SELECT *
FROM `clientes`

    public function agregar()
    {
        $cliente = new ClientesModel();
        $datos = [
            'cliente_id' => $this->request->getPost('id_cliente'),
            'email' => $this->request->getPost('txt_email'),
            'contrasenia' => $this->request->getPost('pwd_cliente'),
            'nombre' => $this->request->getPost('txt_nombre'),
            'apellido' => $this->request->getPost('txt_apellido'),
            'fecha_nac' => $this->request->getPost('dt_nacimiento'),
        ];
        $cliente->insert($datos);
---
INSERT INTO `clientes` (`cliente_id`, `email`, `contrasenia`, `nombre`, `apellido`, `fecha_nac`) VALUES ('4', 'felipe@gmail.com', '12345', 'Felipe', 'Herrera', '2007-07-12')

    public function buscar($id)
    {
        $cliente = new ClientesModel();
        $datos['datos']=$cliente->where(['cliente_id'=>$id])->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '3'
 LIMIT 1