app/Controllers/EmpleadoController.php

SELECT COUNT(*) AS `numrows`
FROM `pedido`
WHERE `estado_id` = 5
SELECT *
FROM `pedido`
WHERE `estado_id` = 1
---
    public function index()
    {

        $pedidosModel = new PedidosModel();
        //'Pedidos' es el nombre del array que contiene el total de pedidos hecho por el metodo Countall que muestra
// el total de pedidos de la base de datos
        $totalPedidos = $pedidosModel->where('estado_id', 1)->findAll();

SELECT `pedido`.*, `clientes`.`nombre` AS `nombre_cliente`
FROM `pedido`
JOIN `clientes` ON `clientes`.`cliente_id` = `pedido`.`cliente_id`
WHERE `pedido`.`pedido_id` = '1'
 LIMIT 1
---
public function detallePedido($pedidoId)
{
    $pedidosModel = new PedidosModel();
    $detalleModel = new DetallePedidoModel();

    $pedido = $pedidosModel
        ->select('pedido.*, clientes.nombre AS nombre_cliente')
        ->join('clientes', 'clientes.cliente_id = pedido.cliente_id')
        ->where('pedido.pedido_id', $pedidoId)
        ->first();