app/Controllers/EmpleadosController.php

SELECT *
FROM `empleado`
---
    public function index()
    {
        $empleado = new EmpleadosModel();
        $datos['empleados'] = $empleado->findAll();

INSERT INTO `empleado` (`dpi_empleado`, `contrasenia`, `email`, `nombre`, `apellido`, `rol_id`) VALUES ('1011', '5486', 'carlos@gmail.com', 'Carlos', 'Guzman ', '1')
---
    public function agregar()
    {
        $empleado = new EmpleadosModel();
        $datos = [
            'dpi_empleado' => $this->request->getPost('id_empleado'),
            'email' => $this->request->getPost('txt_email'),
            'contrasenia' => $this->request->getPost('pwd_cliente'),
            'nombre' => $this->request->getPost('txt_nombre'),
            'apellido' => $this->request->getPost('txt_apellido'),
            'rol_id' => $this->request->getPost('rol_id'),
        ];
        $empleado->insert($datos);