app/Controllers/HomeController.php

SELECT *
FROM `productos`
---
    public function index()
    {
        $productoModel = new ProductoModel();
        $productos = $productoModel->findAll();