app/Controllers/LoginClienteController.php

SELECT *
FROM `clientes`
WHERE `email` = 'karenhernandezgt03@gmail.com'
AND `contrasenia` = '123456'
 LIMIT 1
---
    public function login()
    {

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $clienteModel = new ClienteModel();
        $cliente = $clienteModel->where('email', $email)
            ->where('contrasenia', $password)->first();