app/Controllers/LoginEmpleadoController.php

SELECT *
FROM `empleado`
WHERE `email` = 'admin@suplementos.com'
AND `contrasenia` = 'pass123'
 LIMIT 1
---
 public function loginempleado()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $empleadoModel = new EmpleadoModel();
        $empleado = $empleadoModel->where('email', $email)
                                  ->where('contrasenia', $password)
                                  ->first();