app/Models/DetallePedidoModel.php

public function obtenerDetalleConProducto($pedidoId)
{
    return $this->db->table('detalle_pedido')
        ->select('detalle_pedido.producto_id, detalle_pedido.cantidad, productos.nombre AS nombre_producto, productos.precio')
        ->join('productos', 'productos.producto_id = detalle_pedido.producto_id')
        ->where('detalle_pedido.pedido_id', $pedidoId)
        ->get()->getResultArray();
---
SELECT `detalle_pedido`.`producto_id`, `detalle_pedido`.`cantidad`, `productos`.`nombre` AS `nombre_producto`, `productos`.`precio`
FROM `detalle_pedido`
JOIN `productos` ON `productos`.`producto_id` = `detalle_pedido`.`producto_id`
WHERE `detalle_pedido`.`pedido_id` = '1'