app/Models/PedidosModel.php

public function obtenerAsignados()
{
    return $this->where('estado_id', 2)->findAll();
---
SELECT *
FROM `pedido`
WHERE `estado_id` = 2